n30nex/SIGUI/main/hal/rp2040_bridge.c
#include "rp2040_bridge.h"

#include <stddef.h>
#include <stdio.h>
#include <string.h>

#include "driver/uart.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"

#include "hal/indicator_pins.h"
#include "tca9535.h"

#define D1L_RP2040_UART_BUF_SIZE 1024
#define D1L_RP2040_PING_QUERY "DESKOS_SD_PING\n"
#define D1L_RP2040_PING_REPLY_PREFIX "DESKOS_SD_PING"
#define D1L_RP2040_SD_QUERY "DESKOS_SD_STATUS\n"
#define D1L_RP2040_SD_REPLY_PREFIX "DESKOS_SD_STATUS"
#define D1L_RP2040_SD_MOUNT_QUERY "DESKOS_SD_MOUNT\n"
#define D1L_RP2040_SD_MOUNT_REPLY_PREFIX "DESKOS_SD_MOUNT"
#define D1L_RP2040_SD_DIAG_QUERY "DESKOS_SD_DIAG\n"
#define D1L_RP2040_SD_DIAG_REPLY_PREFIX "DESKOS_SD_DIAG"
#define D1L_RP2040_FILE_PREFIX "DESKOS_SD_FILE"
#define D1L_RP2040_LINE_BUFFER_SIZE (D1L_RP2040_FILE_LINE_MAX + 1U)
#define D1L_RP2040_PATH64_MAX (((D1L_RP2040_FILE_PATH_MAX + 2U) / 3U) * 4U)
#define D1L_RP2040_DATA64_MAX (((D1L_RP2040_FILE_CHUNK_MAX + 2U) / 3U) * 4U)

static d1l_rp2040_status_t s_status = {
    .uart_ready = false,
    .init_result = ESP_ERR_INVALID_STATE,
    .buffered_bytes = 0,
};

static uint16_t s_file_request_id = 1;

static bool line_has_prefix(const char *line, const char *prefix)
{
    const size_t prefix_len = strlen(prefix);
    return line &&
           strncmp(line, prefix, prefix_len) == 0 &&
           (line[prefix_len] == '\0' || line[prefix_len] == ' ');
}

static bool token_value_span(const char *line, const char *key, const char **out_value,
                             size_t *out_len)
{
    if (!line || !key || !out_value || !out_len) {
        return false;
    }
    const size_t key_len = strlen(key);
    const char *p = line;
    while (*p) {
        while (*p == ' ') {
            ++p;
        }
        const char *token = p;
        while (*p && *p != ' ') {
            ++p;
        }
        const size_t token_len = (size_t)(p - token);
        if (token_len > key_len + 1U &&
            strncmp(token, key, key_len) == 0 &&
            token[key_len] == '=') {
            *out_value = token + key_len + 1U;
            *out_len = token_len - key_len - 1U;
            return true;
        }
    }
    return false;
}

static bool copy_token_value(const char *line, const char *key, char *dest, size_t dest_size)
{
    const char *value = NULL;
    size_t value_len = 0;
    if (!dest || dest_size == 0 ||
        !token_value_span(line, key, &value, &value_len) ||
        value_len + 1U > dest_size) {
        return false;
    }
    memcpy(dest, value, value_len);
    dest[value_len] = '\0';
    return true;
}

static bool parse_bool_token(const char *line, const char *key, bool *out_value)
{
    const char *value = NULL;
    size_t value_len = 0;
    if (!out_value || !token_value_span(line, key, &value, &value_len)) {
        return false;
    }
    if (value_len == 1U && value[0] == '1') {
        *out_value = true;
        return true;
    }
    if (value_len == 1U && value[0] == '0') {
        *out_value = false;
        return true;
    }
    return false;
}

static bool parse_u32_token(const char *line, const char *key, uint32_t *out_value)
{
    const char *value = NULL;
    size_t value_len = 0;
    if (!out_value || !token_value_span(line, key, &value, &value_len) || value_len == 0) {
        return false;
    }
    uint32_t parsed = 0;
    for (size_t i = 0; i < value_len; ++i) {
        if (value[i] < '0' || value[i] > '9') {
            return false;
        }
        const uint32_t digit = (uint32_t)(value[i] - '0');
        if (parsed > (UINT32_MAX - digit) / 10U) {
            return false;
        }
        parsed = parsed * 10U + digit;
    }
    *out_value = parsed;
    return true;
}

static bool parse_hex_u32_token(const char *line, const char *key, uint32_t *out_value)
{
    const char *value = NULL;
    size_t value_len = 0;
    if (!out_value || !token_value_span(line, key, &value, &value_len) || value_len != 8U) {
        return false;
    }
    uint32_t parsed = 0;
    for (size_t i = 0; i < value_len; ++i) {
        char c = value[i];
        uint32_t digit = 0;
        if (c >= '0' && c <= '9') {
            digit = (uint32_t)(c - '0');
        } else if (c >= 'A' && c <= 'F') {
            digit = (uint32_t)(c - 'A' + 10);
        } else if (c >= 'a' && c <= 'f') {
            digit = (uint32_t)(c - 'a' + 10);
        } else {
            return false;
        }
        parsed = (parsed << 4) | digit;
    }
    *out_value = parsed;
    return true;
}

static void parse_word_token(const char *line, const char *key, char *dest, size_t dest_size)
{
    if (!copy_token_value(line, key, dest, dest_size) && dest && dest_size > 0) {
        dest[0] = '\0';
    }
}

static void init_sd_status(d1l_rp2040_sd_status_t *status, esp_err_t err)
{
    memset(status, 0, sizeof(*status));
    status->bridge_ready = s_status.uart_ready;
    status->last_error = err;
    snprintf(status->state, sizeof(status->state), "%s",
             s_status.uart_ready ? "protocol_pending" : "bridge_unavailable");
    snprintf(status->filesystem, sizeof(status->filesystem), "unknown");
    snprintf(status->note, sizeof(status->note), "%s",
             s_status.uart_ready ?
             "RP2040 UART is ready but DeskOS SD status protocol has not answered" :
             "RP2040 UART bridge is unavailable");
    snprintf(status->probe_power, sizeof(status->probe_power), "unknown");
    snprintf(status->probe_mode, sizeof(status->probe_mode), "unknown");
}

static void init_ping(d1l_rp2040_ping_t *ping, esp_err_t err)
{
    memset(ping, 0, sizeof(*ping));
    ping->bridge_ready = s_status.uart_ready;
    ping->last_error = err;
    snprintf(ping->note, sizeof(ping->note), "%s",
             s_status.uart_ready ?
             "RP2040 UART is ready but DeskOS ping has not answered" :
             "RP2040 UART bridge is unavailable");
}

static void init_sd_diag(d1l_rp2040_sd_diag_t *diag, esp_err_t err)
{
    memset(diag, 0, sizeof(*diag));
    diag->bridge_ready = s_status.uart_ready;
    diag->last_error = err;
    snprintf(diag->pins, sizeof(diag->pins), "unknown");
    snprintf(diag->selected_power, sizeof(diag->selected_power), "unknown");
    snprintf(diag->selected_mode, sizeof(diag->selected_mode), "unknown");
    snprintf(diag->note, sizeof(diag->note), "%s",
             s_status.uart_ready ?
             "RP2040 UART is ready but SD diagnostics have not answered" :
             "RP2040 UART bridge is unavailable");
}

