n30nex/SIGUI/main/hal/rp2040_bridge.c
static void init_file_result(d1l_rp2040_file_result_t *result, esp_err_t err)
{
    memset(result, 0, sizeof(*result));
    result->bridge_ready = s_status.uart_ready;
    result->last_error = err;
    snprintf(result->op, sizeof(result->op), "unknown");
    if (err != ESP_OK) {
        snprintf(result->err, sizeof(result->err), "local_error");
        snprintf(result->note, sizeof(result->note), "local_error");
    }
}

static esp_err_t map_file_error(const char *err)
{
    if (!err || err[0] == '\0') {
        return ESP_FAIL;
    }
    if (strcmp(err, "no_card") == 0 || strcmp(err, "not_found") == 0) {
        return ESP_ERR_NOT_FOUND;
    }
    if (strcmp(err, "not_ready") == 0 || strcmp(err, "exists") == 0 ||
        strcmp(err, "is_dir") == 0) {
        return ESP_ERR_INVALID_STATE;
    }
    if (strcmp(err, "bad_path") == 0 || strcmp(err, "bad_request") == 0 ||
        strcmp(err, "bad_value") == 0 || strcmp(err, "decode_failed") == 0 ||
        strcmp(err, "crc_mismatch") == 0) {
        return ESP_ERR_INVALID_ARG;
    }
    if (strcmp(err, "range") == 0 || strcmp(err, "too_large") == 0 ||
        strcmp(err, "line_too_long") == 0) {
        return ESP_ERR_INVALID_SIZE;
    }
    if (strcmp(err, "unsupported_op") == 0) {
        return ESP_ERR_NOT_SUPPORTED;
    }
    if (strcmp(err, "timeout") == 0) {
        return ESP_ERR_TIMEOUT;
    }
    return ESP_FAIL;
}

static bool is_path_char(char c)
{
    return (c >= 'A' && c <= 'Z') ||
           (c >= 'a' && c <= 'z') ||
           (c >= '0' && c <= '9') ||
           c == '.' || c == '_' || c == '-' || c == '/';
}

static bool validate_relative_path(const char *path)
{
    if (!path) {
        return false;
    }
    const size_t len = strlen(path);
    if (len == 0 || len > D1L_RP2040_FILE_PATH_MAX ||
        path[0] == '/' || path[len - 1U] == '/' ||
        strstr(path, "..") || strstr(path, "//")) {
        return false;
    }
    const char *segment = path;
    for (size_t i = 0; i <= len; ++i) {
        const char c = path[i];
        if (c == '/' || c == '\0') {
            const size_t segment_len = (size_t)(&path[i] - segment);
            if (segment_len == 0 ||
                (segment_len == 1U && segment[0] == '.') ||
                (segment_len == 2U && segment[0] == '.' && segment[1] == '.')) {
                return false;
            }
            segment = &path[i + 1U];
            continue;
        }
        if (!is_path_char(c)) {
            return false;
        }
    }
    return true;
}

static uint32_t crc32_bytes(const uint8_t *data, size_t len)
{
    uint32_t crc = 0xFFFFFFFFUL;
    for (size_t i = 0; i < len; ++i) {
        crc ^= data[i];
        for (int bit = 0; bit < 8; ++bit) {
            const uint32_t mask = (uint32_t)(-((int32_t)(crc & 1U)));
            crc = (crc >> 1) ^ (0xEDB88320UL & mask);
        }
    }
    return ~crc;
}

static void crc32_hex(uint32_t crc, char out[9])
{
    snprintf(out, 9, "%08lX", (unsigned long)crc);
}

static size_t base64url_encoded_len(size_t len)
{
    if (len == 0) {
        return 0;
    }
    const size_t padded = ((len + 2U) / 3U) * 4U;
    const size_t pad = (3U - (len % 3U)) % 3U;
    return padded - pad;
}

static bool base64url_encode(const uint8_t *data, size_t len, char *out, size_t out_size)
{
    static const char table[] =
        "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789-_";
    const size_t encoded_len = base64url_encoded_len(len);
    if (!out || out_size <= encoded_len || (!data && len > 0)) {
        return false;
    }
    size_t used = 0;
    for (size_t i = 0; i < len; i += 3U) {
        const uint32_t b0 = data[i];
        const uint32_t b1 = (i + 1U < len) ? data[i + 1U] : 0U;
        const uint32_t b2 = (i + 2U < len) ? data[i + 2U] : 0U;
        const uint32_t triple = (b0 << 16) | (b1 << 8) | b2;
        out[used++] = table[(triple >> 18) & 0x3FU];
        out[used++] = table[(triple >> 12) & 0x3FU];
        if (i + 1U < len) {
            out[used++] = table[(triple >> 6) & 0x3FU];
        }
        if (i + 2U < len) {
            out[used++] = table[triple & 0x3FU];
        }
    }
    out[used] = '\0';
    return used == encoded_len;
}

static int base64url_value(char c)
{
    if (c >= 'A' && c <= 'Z') {
        return c - 'A';
    }
    if (c >= 'a' && c <= 'z') {
        return c - 'a' + 26;
    }
    if (c >= '0' && c <= '9') {
        return c - '0' + 52;
    }
    if (c == '-') {
        return 62;
    }
    if (c == '_') {
        return 63;
    }
    return -1;
}

static bool base64url_decode(const char *input, uint8_t *out, size_t out_size,
                             size_t *out_len)
{
    if (!input || !out || !out_len) {
        return false;
    }
    const size_t input_len = strlen(input);
    if ((input_len % 4U) == 1U) {
        return false;
    }
    uint32_t value = 0;
    int value_bits = -8;
    size_t used = 0;
    for (size_t i = 0; i < input_len; ++i) {
        const int part = base64url_value(input[i]);
        if (part < 0) {
            return false;
        }
        value = (value << 6) | (uint32_t)part;
        value_bits += 6;
        if (value_bits >= 0) {
            if (used >= out_size) {
                return false;
            }
            out[used++] = (uint8_t)((value >> value_bits) & 0xFFU);
            value_bits -= 8;
        }
    }
    *out_len = used;
    return true;
}

static bool encode_path(const char *path, char *encoded, size_t encoded_size)
{
    return validate_relative_path(path) &&
           base64url_encode((const uint8_t *)path, strlen(path), encoded, encoded_size);
}

static esp_err_t exchange_prefixed_line_internal(const char *command, size_t command_len,
                                                 const char *const *prefixes, size_t prefix_count,
                                                 char *line, size_t line_size,
                                                 uint32_t timeout_ms,
                                                 bool extend_timeout_on_rx,
                                                 bool *response_truncated,
                                                 const char *progress_prefix,
                                                 char *last_progress,
                                                 size_t last_progress_size)
{
    if (!s_status.uart_ready) {
        return s_status.init_result;
    }
    if (!command || command_len == 0 || !prefixes || prefix_count == 0 ||
        !line || line_size < 2) {
        return ESP_ERR_INVALID_ARG;
    }

    if (response_truncated) {
        *response_truncated = false;
    }
    if (last_progress && last_progress_size > 0) {
        last_progress[0] = '\0';
    }
    uart_flush_input((uart_port_t)s_status.uart_port);
    const int written = uart_write_bytes((uart_port_t)s_status.uart_port, command, command_len);
    if (written != (int)command_len) {
        return ESP_FAIL;
    }

    const int64_t timeout_us = (int64_t)timeout_ms * 1000LL;
    int64_t deadline_us = esp_timer_get_time() + timeout_us;
    size_t used = 0;
    bool dropping = false;
    while (esp_timer_get_time() < deadline_us) {
        uint8_t ch = 0;
        int len = uart_read_bytes((uart_port_t)s_status.uart_port, &ch, 1, pdMS_TO_TICKS(10));
        if (len <= 0) {
            continue;
        }
        if (extend_timeout_on_rx) {
            deadline_us = esp_timer_get_time() + timeout_us;
        }
        if (ch == '\r') {
            continue;
        }
        if (ch == '\n') {
            if (!dropping) {
                line[used] = '\0';
                for (size_t i = 0; i < prefix_count; ++i) {
                    if (line_has_prefix(line, prefixes[i])) {
                        return ESP_OK;
                    }
                }
                if (progress_prefix && line_has_prefix(line, progress_prefix) &&
                    last_progress && last_progress_size > 0) {
                    const char *step = NULL;
                    size_t step_len = 0;
                    if (token_value_span(line, "step", &step, &step_len) &&
                        step_len + 1U <= last_progress_size) {
                        memcpy(last_progress, step, step_len);
                        last_progress[step_len] = '\0';
                    } else {
                        snprintf(last_progress, last_progress_size, "progress");
                    }
                }
            }
            used = 0;
            dropping = false;
            continue;
        }
        if (dropping) {
            continue;
        }
        if (used + 1U < line_size) {
            line[used++] = (char)ch;
        } else {
            used = 0;
            dropping = true;
            if (response_truncated) {
                *response_truncated = true;
            }
        }
    }
    return ESP_ERR_TIMEOUT;
}

