n30nex/SIGUI/main/hal/rp2040_bridge.c
static esp_err_t exchange_prefixed_line(const char *command, size_t command_len,
                                        const char *const *prefixes, size_t prefix_count,
                                        char *line, size_t line_size, uint32_t timeout_ms,
                                        bool *response_truncated)
{
    return exchange_prefixed_line_internal(command, command_len, prefixes, prefix_count,
                                           line, line_size, timeout_ms, false,
                                           response_truncated, NULL, NULL, 0);
}

static esp_err_t parse_sd_line_with_prefix(const char *line,
                                           const char *prefix,
                                           d1l_rp2040_sd_status_t *status)
{
    if (!line || !prefix || !status || !line_has_prefix(line, prefix)) {
        return ESP_FAIL;
    }

    init_sd_status(status, ESP_OK);
    status->protocol_supported = true;
    parse_word_token(line, "state", status->state, sizeof(status->state));
    parse_word_token(line, "fs", status->filesystem, sizeof(status->filesystem));
    parse_word_token(line, "note", status->note, sizeof(status->note));
    (void)parse_bool_token(line, "present", &status->card_present);
    (void)parse_bool_token(line, "mounted", &status->filesystem_mounted);
    (void)parse_bool_token(line, "deskos", &status->deskos_root_ready);
    bool legacy_format_required = false;
    (void)parse_bool_token(line, "needs_fat32", &status->needs_fat32);
    if (parse_bool_token(line, "format_required", &legacy_format_required) &&
        legacy_format_required) {
        status->needs_fat32 = true;
    }
    (void)parse_bool_token(line, "file_ops", &status->file_ops_supported);
    (void)parse_bool_token(line, "atomic_rename", &status->atomic_rename_supported);
    (void)parse_u32_token(line, "capacity_kb", &status->capacity_kb);
    (void)parse_u32_token(line, "free_kb", &status->free_kb);
    (void)parse_u32_token(line, "file_line_max", &status->file_line_max);
    (void)parse_u32_token(line, "file_chunk_max", &status->file_chunk_max);
    (void)parse_u32_token(line, "path_max", &status->path_max);
    (void)parse_u32_token(line, "probe_err", &status->probe_error);
    (void)parse_u32_token(line, "probe_data", &status->probe_data);
    (void)parse_u32_token(line, "mount_err", &status->mount_error);
    (void)parse_u32_token(line, "mount_data", &status->mount_data);
    parse_word_token(line, "probe_power", status->probe_power, sizeof(status->probe_power));
    parse_word_token(line, "probe_mode", status->probe_mode, sizeof(status->probe_mode));

    if (status->card_present && !status->filesystem_mounted) {
        status->needs_fat32 = true;
    }
    status->data_ready = status->card_present &&
                         status->filesystem_mounted &&
                         status->deskos_root_ready &&
                         !status->needs_fat32;
    if (status->state[0] == '\0') {
        snprintf(status->state, sizeof(status->state), "%s",
                 status->data_ready ? "ready" :
                 status->needs_fat32 ? "not_fat32_or_unmountable" :
                 status->card_present ? "deskos_manifest_invalid" : "no_card");
    }
    if (status->filesystem[0] == '\0') {
        snprintf(status->filesystem, sizeof(status->filesystem), "unknown");
    }
    if (status->note[0] == '\0') {
        const bool mount_failed_with_diag = status->card_present &&
                                           !status->filesystem_mounted &&
                                           (status->mount_error != 0U ||
                                            status->mount_data != 0U);
        snprintf(status->note, sizeof(status->note), "%s",
                 status->data_ready ? "SD card is ready for DeskOS data" :
                 mount_failed_with_diag ? "RP2040 SD filesystem mount failed; inspect firmware mount diagnostics" :
                 status->needs_fat32 ? "Prepare a FAT32 card on a computer before using SD storage" :
                 "SD card is not ready for DeskOS data");
    }
    return ESP_OK;
}

static esp_err_t parse_sd_status_line(const char *line, d1l_rp2040_sd_status_t *status)
{
    return parse_sd_line_with_prefix(line, D1L_RP2040_SD_REPLY_PREFIX, status);
}

static esp_err_t parse_sd_mount_line(const char *line, d1l_rp2040_sd_status_t *status)
{
    return parse_sd_line_with_prefix(line, D1L_RP2040_SD_MOUNT_REPLY_PREFIX, status);
}

static esp_err_t parse_ping_line(const char *line, d1l_rp2040_ping_t *ping)
{
    if (!line || !ping || !line_has_prefix(line, D1L_RP2040_PING_REPLY_PREFIX)) {
        return ESP_FAIL;
    }

    init_ping(ping, ESP_OK);
    ping->protocol_supported = true;
    (void)parse_u32_token(line, "v", &ping->protocol_version);
    (void)parse_u32_token(line, "file_line_max", &ping->file_line_max);
    (void)parse_u32_token(line, "file_chunk_max", &ping->file_chunk_max);
    (void)parse_u32_token(line, "path_max", &ping->path_max);
    (void)parse_bool_token(line, "atomic_rename", &ping->atomic_rename_supported);
    (void)parse_bool_token(line, "sd_touch", &ping->sd_touched);
    snprintf(ping->note, sizeof(ping->note), "%s",
             ping->sd_touched ? "ping_touched_sd" : "ok_no_sd_touch");
    return ESP_OK;
}

static esp_err_t parse_sd_diag_line(const char *line, d1l_rp2040_sd_diag_t *diag)
{
    if (!line || !diag || !line_has_prefix(line, D1L_RP2040_SD_DIAG_REPLY_PREFIX)) {
        return ESP_FAIL;
    }

    init_sd_diag(diag, ESP_OK);
    diag->protocol_supported = true;
    snprintf(diag->raw_line, sizeof(diag->raw_line), "%s", line);
    parse_word_token(line, "pins", diag->pins, sizeof(diag->pins));
    parse_word_token(line, "selected_power", diag->selected_power, sizeof(diag->selected_power));
    parse_word_token(line, "selected_mode", diag->selected_mode, sizeof(diag->selected_mode));
    (void)parse_bool_token(line, "mount_selected", &diag->mount_selected);
    (void)parse_u32_token(line, "hz", &diag->spi_hz);
    (void)parse_bool_token(line, "hd_p", &diag->high_dedicated_present);
    (void)parse_u32_token(line, "hd_e", &diag->high_dedicated_error);
    (void)parse_u32_token(line, "hd_d", &diag->high_dedicated_data);
    (void)parse_u32_token(line, "hd_kb", &diag->high_dedicated_capacity_kb);
    (void)parse_bool_token(line, "hs_p", &diag->high_shared_present);
    (void)parse_u32_token(line, "hs_e", &diag->high_shared_error);
    (void)parse_u32_token(line, "hs_d", &diag->high_shared_data);
    (void)parse_u32_token(line, "hs_kb", &diag->high_shared_capacity_kb);
    (void)parse_bool_token(line, "ld_p", &diag->low_dedicated_present);
    (void)parse_u32_token(line, "ld_e", &diag->low_dedicated_error);
    (void)parse_u32_token(line, "ld_d", &diag->low_dedicated_data);
    (void)parse_u32_token(line, "ld_kb", &diag->low_dedicated_capacity_kb);
    (void)parse_bool_token(line, "ls_p", &diag->low_shared_present);
    (void)parse_u32_token(line, "ls_e", &diag->low_shared_error);
    (void)parse_u32_token(line, "ls_d", &diag->low_shared_data);
    (void)parse_u32_token(line, "ls_kb", &diag->low_shared_capacity_kb);
    snprintf(diag->note, sizeof(diag->note), "%s",
             diag->mount_selected ? "selected_probe_mounted" :
             (diag->high_dedicated_present || diag->high_shared_present ||
              diag->low_dedicated_present || diag->low_shared_present) ?
             "raw_card_present_mount_failed" : "raw_card_not_detected");
    return ESP_OK;
}

static uint16_t next_file_request_id(void)
{
    const uint16_t id = s_file_request_id;
    ++s_file_request_id;
    if (s_file_request_id == 0) {
        s_file_request_id = 1;
    }
    return id;
}

static esp_err_t parse_file_line(const char *line, uint16_t expected_id,
                                 const char *expected_op, uint8_t *out_data,
                                 size_t out_data_size,
                                 d1l_rp2040_file_result_t *result)
{
    if (!line || !expected_op || !result || !line_has_prefix(line, D1L_RP2040_FILE_PREFIX)) {
        return ESP_FAIL;
    }

    init_file_result(result, ESP_OK);
    result->protocol_supported = true;
    uint32_t version = 0;
    uint32_t request_id = 0;
    if (!parse_u32_token(line, "v", &version) ||
        version != D1L_RP2040_FILE_PROTOCOL_VERSION ||
        !parse_u32_token(line, "id", &request_id) ||
        request_id != expected_id ||
        !parse_bool_token(line, "ok", &result->ok)) {
        result->last_error = ESP_FAIL;
        snprintf(result->err, sizeof(result->err), "bad_response");
        snprintf(result->note, sizeof(result->note), "bad_response");
        return ESP_FAIL;
    }
    result->request_id = (uint16_t)request_id;
    parse_word_token(line, "op", result->op, sizeof(result->op));
    parse_word_token(line, "err", result->err, sizeof(result->err));
    parse_word_token(line, "note", result->note, sizeof(result->note));
    if (strcmp(result->op, expected_op) != 0) {
        result->last_error = ESP_FAIL;
        snprintf(result->err, sizeof(result->err), "op_mismatch");
        snprintf(result->note, sizeof(result->note), "op_mismatch");
        return ESP_FAIL;
    }
    if (!result->ok) {
        result->last_error = map_file_error(result->err);
        return result->last_error;
    }

    if (strcmp(expected_op, "stat") == 0) {
        bool exists = false;
        (void)parse_bool_token(line, "exists", &exists);
        result->exists = exists;
        char kind[8] = {0};
        parse_word_token(line, "kind", kind, sizeof(kind));
        result->is_directory = (strcmp(kind, "dir") == 0);
        (void)parse_u32_token(line, "size", &result->size);
    } else if (strcmp(expected_op, "read") == 0) {
        (void)parse_u32_token(line, "off", &result->offset);
        (void)parse_u32_token(line, "len", &result->length);
        (void)parse_bool_token(line, "eof", &result->eof);
        if (result->length > out_data_size || result->length > D1L_RP2040_FILE_CHUNK_MAX ||
            !out_data) {
            result->last_error = ESP_ERR_INVALID_SIZE;
            return result->last_error;
        }
        char encoded[D1L_RP2040_DATA64_MAX + 1U];
        if (!copy_token_value(line, "data", encoded, sizeof(encoded)) ||
            !parse_hex_u32_token(line, "crc", &result->crc32)) {
            result->last_error = ESP_FAIL;
            return result->last_error;
        }
        size_t decoded_len = 0;
        if (!base64url_decode(encoded, out_data, out_data_size, &decoded_len) ||
            decoded_len != result->length ||
            crc32_bytes(out_data, decoded_len) != result->crc32) {
            result->last_error = ESP_FAIL;
            return result->last_error;
        }
    } else if (strcmp(expected_op, "write") == 0 || strcmp(expected_op, "append") == 0) {
        (void)parse_u32_token(line, "off", &result->offset);
        (void)parse_u32_token(line, "len", &result->length);
        (void)parse_u32_token(line, "size", &result->size);
    }

