n30nex/SIGUI/main/hal/rp2040_bridge.c
    result->last_error = ESP_OK;
    return ESP_OK;
}

static esp_err_t send_file_command(const char *command, size_t command_len,
                                   uint16_t request_id, const char *expected_op,
                                   uint8_t *out_data, size_t out_data_size,
                                   d1l_rp2040_file_result_t *out_result,
                                   uint32_t timeout_ms)
{
    if (!out_result) {
        return ESP_ERR_INVALID_ARG;
    }
    if (!s_status.uart_ready) {
        init_file_result(out_result, s_status.init_result);
        return s_status.init_result;
    }

    const char *prefixes[] = {D1L_RP2040_FILE_PREFIX};
    char line[D1L_RP2040_LINE_BUFFER_SIZE];
    bool truncated = false;
    init_file_result(out_result, ESP_ERR_TIMEOUT);
    esp_err_t ret = exchange_prefixed_line(command, command_len, prefixes, 1, line,
                                           sizeof(line), timeout_ms, &truncated);
    if (ret != ESP_OK) {
        out_result->last_error = ret;
        out_result->response_truncated = truncated;
        snprintf(out_result->note, sizeof(out_result->note),
                 ret == ESP_ERR_TIMEOUT ? "timeout" : "query_failed");
        return ret;
    }
    ret = parse_file_line(line, request_id, expected_op, out_data, out_data_size, out_result);
    out_result->response_truncated = truncated;
    return ret;
}

esp_err_t d1l_rp2040_bridge_init(void)
{
    const d1l_rp2040_pins_t *pins = d1l_rp2040_pins();
    s_status.uart_port = pins->uart_port;
    s_status.tx_gpio = pins->esp_tx_gpio;
    s_status.rx_gpio = pins->esp_rx_gpio;
    s_status.baud_rate = pins->baud_rate;
    s_status.reset_expander_pin = pins->expander_reset;

    uart_config_t uart_config = {
        .baud_rate = pins->baud_rate,
        .data_bits = UART_DATA_8_BITS,
        .parity = UART_PARITY_DISABLE,
        .stop_bits = UART_STOP_BITS_1,
        .flow_ctrl = UART_HW_FLOWCTRL_DISABLE,
        .source_clk = UART_SCLK_DEFAULT,
    };

    esp_err_t ret = uart_driver_install((uart_port_t)pins->uart_port, D1L_RP2040_UART_BUF_SIZE, 0, 0, NULL, 0);
    if (ret == ESP_OK || ret == ESP_ERR_INVALID_STATE) {
        ret = uart_param_config((uart_port_t)pins->uart_port, &uart_config);
    }
    if (ret == ESP_OK) {
        ret = uart_set_pin((uart_port_t)pins->uart_port, pins->esp_tx_gpio, pins->esp_rx_gpio,
                           UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE);
    }

    s_status.init_result = ret;
    s_status.uart_ready = (ret == ESP_OK);
    return ret;
}

esp_err_t d1l_rp2040_bridge_status(d1l_rp2040_status_t *out_status)
{
    if (out_status == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    if (s_status.uart_ready) {
        size_t buffered = 0;
        esp_err_t ret = uart_get_buffered_data_len((uart_port_t)s_status.uart_port, &buffered);
        if (ret == ESP_OK) {
            s_status.buffered_bytes = (uint32_t)buffered;
        } else {
            s_status.init_result = ret;
        }
    }
    *out_status = s_status;
    return s_status.init_result;
}

esp_err_t d1l_rp2040_bridge_reset(uint32_t hold_ms, uint32_t settle_ms)
{
    const d1l_rp2040_pins_t *pins = d1l_rp2040_pins();
    const uint32_t hold = hold_ms > 0 ? hold_ms : 100U;
    const uint32_t settle = settle_ms > 0 ? settle_ms : 500U;

    esp_err_t ret = tca9535_set_direction(pins->expander_reset, true);
    if (ret != ESP_OK) {
        return ret;
    }
    ret = tca9535_set_level(pins->expander_reset, false);
    if (ret != ESP_OK) {
        return ret;
    }
    vTaskDelay(pdMS_TO_TICKS(hold));
    ret = tca9535_set_level(pins->expander_reset, true);
    if (ret != ESP_OK) {
        return ret;
    }

    if (s_status.uart_ready) {
        uart_flush_input((uart_port_t)s_status.uart_port);
    }
    vTaskDelay(pdMS_TO_TICKS(settle));
    return ESP_OK;
}

esp_err_t d1l_rp2040_bridge_ping(d1l_rp2040_ping_t *out_ping, uint32_t timeout_ms)
{
    if (out_ping == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    if (!s_status.uart_ready) {
        init_ping(out_ping, s_status.init_result);
        return s_status.init_result;
    }

    const char *prefixes[] = {D1L_RP2040_PING_REPLY_PREFIX};
    char line[D1L_RP2040_LINE_BUFFER_SIZE];
    bool truncated = false;
    init_ping(out_ping, ESP_ERR_TIMEOUT);
    esp_err_t ret = exchange_prefixed_line(D1L_RP2040_PING_QUERY,
                                           strlen(D1L_RP2040_PING_QUERY),
                                           prefixes, 1, line, sizeof(line),
                                           timeout_ms, &truncated);
    out_ping->response_truncated = truncated;
    if (ret != ESP_OK) {
        out_ping->last_error = ret;
        snprintf(out_ping->note, sizeof(out_ping->note),
                 ret == ESP_ERR_TIMEOUT ? "timeout" : "query_failed");
        return ret;
    }
    ret = parse_ping_line(line, out_ping);
    out_ping->response_truncated = truncated;
    out_ping->last_error = ret;
    return ret;
}

esp_err_t d1l_rp2040_bridge_probe_sd(d1l_rp2040_sd_status_t *out_status, uint32_t timeout_ms)
{
    if (out_status == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    if (!s_status.uart_ready) {
        init_sd_status(out_status, s_status.init_result);
        return s_status.init_result;
    }

    const char *prefixes[] = {D1L_RP2040_SD_REPLY_PREFIX};
    char line[D1L_RP2040_LINE_BUFFER_SIZE];
    bool truncated = false;
    init_sd_status(out_status, ESP_ERR_TIMEOUT);
    esp_err_t ret = exchange_prefixed_line(D1L_RP2040_SD_QUERY,
                                           strlen(D1L_RP2040_SD_QUERY),
                                           prefixes, 1, line, sizeof(line),
                                           timeout_ms, &truncated);
    out_status->response_truncated = truncated;
    if (ret != ESP_OK) {
        out_status->last_error = ret;
        if (ret != ESP_ERR_TIMEOUT) {
            snprintf(out_status->state, sizeof(out_status->state), "query_failed");
            snprintf(out_status->note, sizeof(out_status->note),
                     "Could not write SD status query to RP2040 UART");
        }
        return ret;
    }
    ret = parse_sd_status_line(line, out_status);
    out_status->response_truncated = truncated;
    out_status->last_error = ret;
    return ret;
}

esp_err_t d1l_rp2040_bridge_mount_sd(d1l_rp2040_sd_status_t *out_status, uint32_t timeout_ms)
{
    if (out_status == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    if (!s_status.uart_ready) {
        init_sd_status(out_status, s_status.init_result);
        return s_status.init_result;
    }

    const char *prefixes[] = {D1L_RP2040_SD_MOUNT_REPLY_PREFIX};
    char line[D1L_RP2040_LINE_BUFFER_SIZE];
    bool truncated = false;
    init_sd_status(out_status, ESP_ERR_TIMEOUT);
    esp_err_t ret = exchange_prefixed_line(D1L_RP2040_SD_MOUNT_QUERY,
                                           strlen(D1L_RP2040_SD_MOUNT_QUERY),
                                           prefixes, 1, line, sizeof(line),
                                           timeout_ms, &truncated);
    out_status->response_truncated = truncated;
    if (ret != ESP_OK) {
        out_status->last_error = ret;
        if (ret != ESP_ERR_TIMEOUT) {
            snprintf(out_status->state, sizeof(out_status->state), "query_failed");
            snprintf(out_status->note, sizeof(out_status->note),
                     "Could not write SD mount query to RP2040 UART");
        }
        return ret;
    }
    ret = parse_sd_mount_line(line, out_status);
    out_status->response_truncated = truncated;
    out_status->last_error = ret;
    return ret;
}

esp_err_t d1l_rp2040_bridge_sd_diag(d1l_rp2040_sd_diag_t *out_diag, uint32_t timeout_ms)
{
    if (out_diag == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    if (!s_status.uart_ready) {
        init_sd_diag(out_diag, s_status.init_result);
        return s_status.init_result;
    }

    const char *prefixes[] = {D1L_RP2040_SD_DIAG_REPLY_PREFIX};
    char line[D1L_RP2040_LINE_BUFFER_SIZE];
    bool truncated = false;
    init_sd_diag(out_diag, ESP_ERR_TIMEOUT);
    esp_err_t ret = exchange_prefixed_line(D1L_RP2040_SD_DIAG_QUERY,
                                           strlen(D1L_RP2040_SD_DIAG_QUERY),
                                           prefixes, 1, line, sizeof(line),
                                           timeout_ms, &truncated);
    out_diag->response_truncated = truncated;
    if (ret != ESP_OK) {
        out_diag->last_error = ret;
        snprintf(out_diag->note, sizeof(out_diag->note),
                 ret == ESP_ERR_TIMEOUT ? "timeout" : "query_failed");
        return ret;
    }
    ret = parse_sd_diag_line(line, out_diag);
    out_diag->response_truncated = truncated;
    out_diag->last_error = ret;
    return ret;
}

esp_err_t d1l_rp2040_bridge_file_stat(const char *path,
                                      d1l_rp2040_file_result_t *out_result,
                                      uint32_t timeout_ms)
{
    if (!path || !out_result) {
        return ESP_ERR_INVALID_ARG;
    }
    char path64[D1L_RP2040_PATH64_MAX + 1U];
    if (!encode_path(path, path64, sizeof(path64))) {
        init_file_result(out_result, ESP_ERR_INVALID_ARG);
        snprintf(out_result->err, sizeof(out_result->err), "bad_path");
        snprintf(out_result->note, sizeof(out_result->note), "bad_path");
        return ESP_ERR_INVALID_ARG;
    }
    const uint16_t request_id = next_file_request_id();
    char command[D1L_RP2040_FILE_LINE_MAX + 2U];
    const int command_len = snprintf(command, sizeof(command),
                                     "%s v=1 id=%u op=stat path=%s\n",
                                     D1L_RP2040_FILE_PREFIX, (unsigned)request_id, path64);
    if (command_len <= 0 || (size_t)command_len >= sizeof(command)) {
        init_file_result(out_result, ESP_ERR_INVALID_SIZE);
        return ESP_ERR_INVALID_SIZE;
    }
    return send_file_command(command, (size_t)command_len, request_id, "stat",
                             NULL, 0, out_result, timeout_ms);
}

esp_err_t d1l_rp2040_bridge_file_read(const char *path,
                                      uint32_t offset,
                                      uint8_t *out_data,
                                      size_t max_len,
                                      d1l_rp2040_file_result_t *out_result,
                                      uint32_t timeout_ms)
{
    if (!path || !out_data || !out_result || max_len == 0 ||
        max_len > D1L_RP2040_FILE_CHUNK_MAX) {
        return ESP_ERR_INVALID_ARG;
    }
    char path64[D1L_RP2040_PATH64_MAX + 1U];
    if (!encode_path(path, path64, sizeof(path64))) {
        init_file_result(out_result, ESP_ERR_INVALID_ARG);
        snprintf(out_result->err, sizeof(out_result->err), "bad_path");
        snprintf(out_result->note, sizeof(out_result->note), "bad_path");
        return ESP_ERR_INVALID_ARG;
    }
    const uint16_t request_id = next_file_request_id();
    char command[D1L_RP2040_FILE_LINE_MAX + 2U];
    const int command_len = snprintf(command, sizeof(command),
                                     "%s v=1 id=%u op=read path=%s off=%lu len=%lu\n",
                                     D1L_RP2040_FILE_PREFIX, (unsigned)request_id, path64,
                                     (unsigned long)offset, (unsigned long)max_len);
    if (command_len <= 0 || (size_t)command_len >= sizeof(command)) {
        init_file_result(out_result, ESP_ERR_INVALID_SIZE);
        return ESP_ERR_INVALID_SIZE;
    }
    return send_file_command(command, (size_t)command_len, request_id, "read",
                             out_data, max_len, out_result, timeout_ms);
}

esp_err_t d1l_rp2040_bridge_file_write(const char *path,
                                       uint32_t offset,
                                       const uint8_t *data,
                                       size_t len,
                                       bool truncate,
                                       d1l_rp2040_file_result_t *out_result,
                                       uint32_t timeout_ms)
{
    if (!path || !out_result || (len > 0 && !data) || len > D1L_RP2040_FILE_CHUNK_MAX) {
        return ESP_ERR_INVALID_ARG;
    }
    char path64[D1L_RP2040_PATH64_MAX + 1U];
    char data64[D1L_RP2040_DATA64_MAX + 1U];
    char crc[9];
    if (!encode_path(path, path64, sizeof(path64)) ||
        !base64url_encode(data, len, data64, sizeof(data64))) {
        init_file_result(out_result, ESP_ERR_INVALID_ARG);
        snprintf(out_result->err, sizeof(out_result->err), "bad_path");
        snprintf(out_result->note, sizeof(out_result->note), "bad_path");
        return ESP_ERR_INVALID_ARG;
    }
    crc32_hex(crc32_bytes(data, len), crc);
    const uint16_t request_id = next_file_request_id();
    char command[D1L_RP2040_FILE_LINE_MAX + 2U];
    const int command_len = snprintf(command, sizeof(command),
                                     "%s v=1 id=%u op=write path=%s off=%lu len=%lu trunc=%u data=%s crc=%s\n",
                                     D1L_RP2040_FILE_PREFIX, (unsigned)request_id, path64,
                                     (unsigned long)offset, (unsigned long)len,
                                     truncate ? 1U : 0U, data64, crc);
    if (command_len <= 0 || (size_t)command_len >= sizeof(command)) {
        init_file_result(out_result, ESP_ERR_INVALID_SIZE);
        return ESP_ERR_INVALID_SIZE;
    }
    return send_file_command(command, (size_t)command_len, request_id, "write",
                             NULL, 0, out_result, timeout_ms);
}

