n30nex/SIGUI/main/hal/rp2040_bridge.c
esp_err_t d1l_rp2040_bridge_file_append(const char *path,
                                        const uint8_t *data,
                                        size_t len,
                                        d1l_rp2040_file_result_t *out_result,
                                        uint32_t timeout_ms)
{
    if (!path || !out_result || !data || len == 0 || len > D1L_RP2040_FILE_CHUNK_MAX) {
        return ESP_ERR_INVALID_ARG;
    }
    char path64[D1L_RP2040_PATH64_MAX + 1U];
    char data64[D1L_RP2040_DATA64_MAX + 1U];
    char crc[9];
    if (!encode_path(path, path64, sizeof(path64)) ||
        !base64url_encode(data, len, data64, sizeof(data64))) {
        init_file_result(out_result, ESP_ERR_INVALID_ARG);
        snprintf(out_result->err, sizeof(out_result->err), "bad_path");
        snprintf(out_result->note, sizeof(out_result->note), "bad_path");
        return ESP_ERR_INVALID_ARG;
    }
    crc32_hex(crc32_bytes(data, len), crc);
    const uint16_t request_id = next_file_request_id();
    char command[D1L_RP2040_FILE_LINE_MAX + 2U];
    const int command_len = snprintf(command, sizeof(command),
                                     "%s v=1 id=%u op=append path=%s len=%lu data=%s crc=%s\n",
                                     D1L_RP2040_FILE_PREFIX, (unsigned)request_id, path64,
                                     (unsigned long)len, data64, crc);
    if (command_len <= 0 || (size_t)command_len >= sizeof(command)) {
        init_file_result(out_result, ESP_ERR_INVALID_SIZE);
        return ESP_ERR_INVALID_SIZE;
    }
    return send_file_command(command, (size_t)command_len, request_id, "append",
                             NULL, 0, out_result, timeout_ms);
}

esp_err_t d1l_rp2040_bridge_file_delete(const char *path,
                                        d1l_rp2040_file_result_t *out_result,
                                        uint32_t timeout_ms)
{
    if (!path || !out_result) {
        return ESP_ERR_INVALID_ARG;
    }
    char path64[D1L_RP2040_PATH64_MAX + 1U];
    if (!encode_path(path, path64, sizeof(path64))) {
        init_file_result(out_result, ESP_ERR_INVALID_ARG);
        snprintf(out_result->err, sizeof(out_result->err), "bad_path");
        snprintf(out_result->note, sizeof(out_result->note), "bad_path");
        return ESP_ERR_INVALID_ARG;
    }
    const uint16_t request_id = next_file_request_id();
    char command[D1L_RP2040_FILE_LINE_MAX + 2U];
    const int command_len = snprintf(command, sizeof(command),
                                     "%s v=1 id=%u op=delete path=%s\n",
                                     D1L_RP2040_FILE_PREFIX, (unsigned)request_id, path64);
    if (command_len <= 0 || (size_t)command_len >= sizeof(command)) {
        init_file_result(out_result, ESP_ERR_INVALID_SIZE);
        return ESP_ERR_INVALID_SIZE;
    }
    return send_file_command(command, (size_t)command_len, request_id, "delete",
                             NULL, 0, out_result, timeout_ms);
}

esp_err_t d1l_rp2040_bridge_file_rename(const char *from_path,
                                        const char *to_path,
                                        bool replace,
                                        d1l_rp2040_file_result_t *out_result,
                                        uint32_t timeout_ms)
{
    if (!from_path || !to_path || !out_result) {
        return ESP_ERR_INVALID_ARG;
    }
    char from64[D1L_RP2040_PATH64_MAX + 1U];
    char to64[D1L_RP2040_PATH64_MAX + 1U];
    if (!encode_path(from_path, from64, sizeof(from64)) ||
        !encode_path(to_path, to64, sizeof(to64))) {
        init_file_result(out_result, ESP_ERR_INVALID_ARG);
        snprintf(out_result->err, sizeof(out_result->err), "bad_path");
        snprintf(out_result->note, sizeof(out_result->note), "bad_path");
        return ESP_ERR_INVALID_ARG;
    }
    const uint16_t request_id = next_file_request_id();
    char command[D1L_RP2040_FILE_LINE_MAX + 2U];
    const int command_len = snprintf(command, sizeof(command),
                                     "%s v=1 id=%u op=rename path=%s to=%s replace=%u\n",
                                     D1L_RP2040_FILE_PREFIX, (unsigned)request_id, from64, to64,
                                     replace ? 1U : 0U);
    if (command_len <= 0 || (size_t)command_len >= sizeof(command)) {
        init_file_result(out_result, ESP_ERR_INVALID_SIZE);
        return ESP_ERR_INVALID_SIZE;
    }
    return send_file_command(command, (size_t)command_len, request_id, "rename",
                             NULL, 0, out_result, timeout_ms);
}
